{
  "scheduleData": [
    {
      "date": "01.09.2022",
      "mainStage": {
        "events": [
          {
            "time": "10:00",
            "title": "Conference Opening 🥳",
            "speakers": [
              {
                "name": "ETHWarsaw",
                "image": "/public/images/ethwarsaw.svg"
              }
            ]
          },
          {
            "time": "10:30",
            "title": "TrueFi Keynote",
            "speakers": [
              {
                "name": "Bartek Rutkowski (TrueFi)",
                "image": "/public/images/bartek_rutkowski.jpg"
              }
            ]
          },
          {
            "time": "10:45",
            "title": "Ramp Network Keynote",
            "speakers": [
              {
                "name": "Szymon Sypniewicz (Ramp)",
                "image": "/public/images/szymon_sypniewicz.jpeg"
              }
            ]
          },
          {
            "time": "11:00",
            "title": "Flash EVM Oracles & Modular Warp Contracts: a novel approach to on-chain data storage.",
            "description": "New DeFi & Web3 projects require diversified data delivered at a higher frequency to get an edge over competitors. However, the biggest bottleneck for Oracles is the high storage costs of EVM which hinder scalability. We'll present how passing data packages to transaction call data could effectively solve that issue and unlock Web3 potential 🚀 Simultaneously EVM blockchains use a monolithic architecture where recording transactions are tightly coupled with the execution layer. We’ll present an alternative approach where transaction ordering is separated from evaluation and state updates, making the architecture million times cheaper and scalable for computation & storage 💽",
            "speakers": [
              {
                "name": "Jakub Wojciechowski (RedStone)",
                "image": "/public/images/jakub_wojciechowski.jpg"
              }
            ]
          },
          {
            "time": "11:30",
            "title": "Bringing a $450 Trillion TradFi market to DeFi",
            "description": "There is one type of derivative in TradFi that accounts for 450 trillion dollars in notional value, far surpassing even the total size of the stock market. When you take any loan or make a deposit, your bank uses this derivative to manage its risk. Come to learn what this derivative is, how it works, what it is useful for, and how it’s making its way to DeFi.",
            "speakers": [
              {
                "name": "Łukasz Muzyka (IPOR Labs)",
                "image": "/public/images/lukasz_muzyka.png"
              }
            ]
          },
          {
            "time": "12:00",
            "title": "Discussion Panel: L2 Solutions & Scalability",
            "description": "Panelists from Starkware, Adam Gągol (AlephZero), Scroll, ZKX </br> Many of us have heard about various scaling solutions. We're promised low latency, high volume and negligible fees. And yet the why and how often escapes. Not this time.",
            "speakers": [
              {
                "name": "Moderated by Piotr Szlachciak (L2Beat)",
                "image": "/public/images/piotr_szlachciak.png"
              }
            ]
          },
          {
            "time": "13:00",
            "title": "🥟Lunch Break"
          },
          {
            "time": "14:00",
            "title": "Introduction to Arweave and the Permaweb",
            "description": "In this talk, Arweave COO Sebastian Campos Groth will be going over what Arweave is, including it's unique value proposition of permanent storage, scalability, use cases, and affordability. The talk will be non-technical and focus on the core concepts of the Arweave protocol and it's implications in Web 3.0.",
            "speakers": [
              {
                "name": "Sebastian Campos Groth (Arweave)",
                "image": "/public/images/sebastian_campos.jpeg"
              }
            ]
          },
          {
            "time": "14:30",
            "title": "Maker as Backbone Infrastructure for DeFi",
            "description": "Maker has gone through a long evolution over the years. In this talk I will present how I view the future of Maker and how it fits into the larger DeFi ecosystem.",
            "speakers": [
              {
                "name": "Sam MacPherson (hexonaut), (MakerDAO)",
                "image": "/public/images/sam_macpherson.jpg"
              }
            ]
          },
          {
            "time": "15:00",
            "title": "Discussion Panel: DAO & Governance",
            "description": "Panelists: Julien Bouteloup (StakeDAO), Nadia Alvarez (MakerDAO), Romain (PaladinDAO), Francesco Andreoli (ConsenSys)",
            "speakers": [
              {
                "name": "Moderated by Nikita Cikaluk",
                "image": "/public/images/nikita_cikaluk.png"
              }
            ]
          },
          {
            "time": "16:00",
            "title": "Create Frictionless Money",
            "description": "Payment as we know has lots of frictions, with Superfluid money, it becomes truly frictionless, allowing money transferring continuously between accounts with no ongoing cost. In this talk you will learn the basics of the protocol features, how how blockchain enables it and it should also inspire you to create one from scratch!",
            "speakers": [
              {
                "name": "Miao Zhicheng (Superfluid)",
                "image": "/public/images/miao_zhicheng.jpeg"
              }
            ]
          },
          {
            "time": "16:30",
            "title": "Scaling Ethereum with rollups and zero-knowledge-proofs",
            "description": "Orest will share his personal story of diving deep into the intrinsics of crypto – and gradually making zero-knowledge rollups his new profession. He will give a beginner-friendly introduction to the security-decentralisation-scalability trilemma faced by blockchains and outline how Ethereum hopes to resolve its scalability sacrifice with layer 2 solutions. Finally, he’ll explain why he chose zero-knowledge-proof-based rollups as his favourite tech towards that goal, and at what cost they come. Orest is a computer scientist currently working in crypto, but was founder-CTO in the more traditional mHealth sector in his previous life.",
            "speakers": [
              {
                "name": "Orest Tarasiuk (Scroll)",
                "image": "/public/images/orest_tarasiuk.jpg"
              }
            ]
          },
          {
            "time": "17:00",
            "title": "Discussion Panel: DeFi",
            "description": "Panelists: Rajiv Sainani (MakerDAO), Ryan Rodenbaugh (TrueFi), Romina Bungert (Centrifuge), Christophe Fonteneau (Request Finance)",
            "speakers": [
              {
                "name": "Moderated by Łukasz Stoczyński",
                "image": "/public/images/lukasz_stoczynski.jpg"
              }
            ]
          },
          {
            "time": "18:00",
            "title": "Freedom for your data",
            "description": "Wildland is an open source technology that provides reasonably flexible data storage and powerful information management, with an Ethereum-based storage marketplace and implementing the User-Defined Organization & the GLM token in its decentralized governance component. Julian, one of the founders of Golem Foundation which is behind Wildland, will give an introduction to the technology, talk about why the team is developing it & why you might find it exciting - both as a developer and a future user.",
            "speakers": [
              {
                "name": "Julian Zawistowski (Wildland)",
                "image": "/public/images/julian_zawistowski.jpeg"
              }
            ]
          },
          {
            "time": "18:30",
            "title": "MakerDAO Oracle Core Unit Faciliator",
            "description": "Launched in 2016, MakerDAO's Oracles have been a critical component in securing the Maker Protocol and billions of Dai. Now MakerDAO is launching Chronicle, a community-powered decentralized Oracle protocol. Chronicle will enable anyone to get the same bulletproof Oracles powering Maker, for free. This talk will detail the Chronicle stack, and the exciting future plans for Chronicle.",
            "speakers": [
              {
                "name": "Nik Kunkel (Chrionicle)",
                "image": "/public/images/nik_kunkel.png"
              }
            ]
          },
          {
            "time": "19:00",
            "title": "⚡️Lightning Talk Round⚡️",
            "speakers": [
              {
                "name": "ETHWarsaw Community",
                "image": "/public/images/ethwarsaw.svg"
              }
            ]
          },
          {
            "time": "19:30",
            "title": "Happy Hour 🍺🍷"
          },
          {
            "time": "21:00",
            "title": "Opening Party 🎉🕺💃",
            "speakers": [
              {
                "name": "Daivinity",
                "image": "/public/images/daivinity.jpeg"
              }
            ]
          }
        ]
      },
      "workshopStage": {
        "events": [
          {
            "time": "10:30",
            "title": "Dapps, Smart Contracts & Blockchain - everything you wanted to know but were too afraid to ask",
            "description": "Intro to the fundamentals of all blockchain systems and then move on to talking about Ethereum itself. I’ll go through the main elements of the system like accounts, transactions and the concept of gas. I’ll briefly talk about Smart Contracts and their application in building Decentralised Applications.",
            "speakers": [
              {
                "name": "Michał Sieczkowski (TrueFi)",
                "image": "/public/images/michal_sieczkowski.png"
              }
            ]
          },
          {
            "time": "11:30",
            "title": "Write & deploy your first Smart Contract on Ethereum PART I",
            "description": "We’ll first dive into the Solidity syntax to get comfortable reading Solidity code and soon writing some of our own! We’ll learn by examples and get to know the specifics of Smart Contract development. By the end of the workshop we’ll deploy a contract to a live testnet.",
            "speakers": [
              {
                "name": "Łukasz Stankiewicz (TrueFi)",
                "image": "/public/images/lukasz_stankiewicz.jpeg"
              },
              {
                "name": "Michał Sieczkowski (TrueFi)",
                "image": "/public/images/michal_sieczkowski.png"
              }
            ]
          },
          {
            "time": "13:00",
            "title": "🥟Lunch Break"
          },
          {
            "time": "14:00",
            "title": "Testing your Smart Contracts with Waffle",
            "description": "You will go step by step through Smart Contracts development workflow - Using industry standard contracts, writing Solidity code, compiling and testing. You will get to know EthersJS library, and get some hand-on experience with Solidity and ERC20 tokens.",
            "speakers": [
              {
                "name": "Przemysław Rząd (TrueFi)",
                "image": "/public/images/przemyslaw_rzad.jpeg"
              }
            ]
          },
          {
            "time": "15:00",
            "title": "Build your first Decentralized App! - a frontend for your Smart Contracts",
            "description": "During the workshop you will learn how to build decentralized applications using the React library. You'll learn how to interact with blockchain networks by building an application that will connect with contracts created at previous workshops. Additionally, you can receive a set of good practices related to building this type of applications.",
            "speakers": [
              {
                "name": "Justyna Broniszewska (TrueFi)",
                "image": "/public/images/justyna_broniszewska.jpeg"
              }
            ]
          },
          {
            "time": "16:00",
            "title": "TBA",
            "description": "TBA",
            "speakers": [
              {
                "name": "Ramp Network",
                "image": "/public/images/ramp_network.png"
              }
            ]
          },
          {
            "time": "17:00",
            "title": "Upgradeable Smart Contracts via OpenZeppelin Defender",
            "description": "In this workshop I will explain the concept of proxy and upgradeable smart contracts based on OpenZeppelin implementations, how to prepare migrations, how to setup Gnosis Multisig and use it in Timelock using OpenZeppelin Defender platform.",
            "speakers": [
              {
                "name": "IPOR Labs",
                "image": "/public/images/ipor_labs.jpeg"
              }
            ]
          }
        ]
      }
    },
    {
      "date": "02.09.2022",
      "mainStage": {
        "events": [
          {
            "time": "10:00",
            "title": "Beyond ZK-SNARKs: overview of blockchain privacy paradigms",
            "description": "For now, blockchain privacy is associated almost exclusively with ZKPs (mostly ZK-SNARKs, recently also ZK-STARKs), but in fact it is only one of privacy paradigms, which has its limitations. During the talk, I'll will present a rough framework describing what can and can not be achieved with ZKP, and then focus on other cryptographic primitives, namely, trusted execution environments (TEE), and multiparty computation (MPC), in the context of privacy on blockchain.",
            "speakers": [
              {
                "name": "Adam Gągol (Aleph Zero)",
                "image": "/public/images/adam_gagol.png"
              }
            ]
          },
          {
            "time": "10:30",
            "title": "Workshop: Best Practices in Web3 Coding",
            "speakers": [
              {
                "name": "Michał Bazyli",
                "image": "/public/images/michal_bazyli.jpg"
              },
              {
                "name": "Łukasz Mikuła (Halborn)",
                "image": "/public/images/lukasz_mikula.jpg"
              }
            ]
          },
          {
            "time": "11:00",
            "title": "Oh Snap! It's MetaMask! Secure plugins with arbitrary JavaScript execution",
            "description": "MetaMask Snaps is a new feature that allows any developer to extend how the wallet operates through arbitrary JavaScript execution. Wait, in your wallet?! Yes! Snaps uses brand new tech called Secure EcmaScript, that allows us to completely confine external JavaScript, so that it can do only what we allow it to do. This talk is a deep-level technological insight into how Secure EcmaScript works behind the scenes, how you can write your own from ground up and what it takes to provide access to external resources without privilege escalation. We're going to be abusing JavaScript pretty strongly - medium to high JavaScript knowledge will be helpful.",
            "speakers": [
              {
                "name": "Olaf Tomalka (Metamask)",
                "image": "/public/images/olaf_tomalka.jpg"
              }
            ]
          },
          {
            "time": "11:30",
            "title": "Getting on Starknet at Warp Speed",
            "description": "Warp's shiny new 2.0 release makes deploying your Solidity onto StarkNet easy. Follow along with this live coding demo (brace yourselves) of some transpilation examples and their deployment on StarkNet. We'll cover some examples of the changes you would need to make to accommodate Cario's semantics, we'll do a deep dive on some of the transformations the transpiler does, and finally, we'll discuss the future roadmap of the transpiler.",
            "speakers": [
              {
                "name": "Jorik Schellekens (Nethermind)",
                "image": "/public/images/jorik_schellekens.jpeg"
              }
            ]
          },
          {
            "time": "12:00",
            "title": "Discussion Panel: Web3 Trends",
            "description": "Sumit Kishore (Consensys), Paulina Jóśków (Ramp Network), Retro (MakerDAO), Marcin Kaźmierczak (Redstone)",
            "speakers": [
              {
                "name": "Mod: Brian McGleenon (Yahoo Finance)",
                "image": "/public/images/marek_kirejczyk.jpeg"
              }
            ]
          },
          {
            "time": "13:00",
            "title": "🥟Lunch Break"
          },
          {
            "time": "14:00",
            "title": "Hacker rant on Truly Unstoppable Organizations",
            "description": "Semi technical deep dive on potential future of DAOs and application of token-based governance systems.",
            "speakers": [
              {
                "name": "Marcin Majchrzak (AngelBlock)",
                "image": "/public/images/marcin_majchrzak.png"
              }
            ]
          },
          {
            "time": "14:30",
            "title": "Tips and tricks for cross-domain devs",
            "description": "Cross-domain development raises new interesting challenges. Maintaining two sets of smart contracts that suppose to talk to each during all sorts of network conditions is not exactly trivial. There is a good reason why bridge hacks are so popular. This talk is about lessons learned from building the official DAI bridge for Optimism and Arbitrum rollups.",
            "speakers": [
              {
                "name": "Kris Kaczor (L2Beat)",
                "image": "/public/images/kris_kaczor.png"
              }
            ]
          },
          {
            "time": "15:00",
            "title": "How to automate your smart contracts using off-chain data & computation",
            "description": "Smart contract automation has been one of the key innovations for the DeFi space. We have only just scratched the surface of automation's potential in DeFi , from user-friendly trading strategies to infrastructure-level liquidation protection. The next step is being able to integrate off-chain data into smart contract automation, enabling projects to automatically trigger actions when specified real-world conditions are met. Gelato Network is Web3's premier automation network, enabling developers to automate a wide variety of arbitrary smart contract executions on and across all EVM-compatible blockchains. Examples of use cases developers have built on top of Gelato include Limit Orders on AMMs like Uniswap, automatic compounding of yield farming vaults, Aave liquidation protection, MakerDAO debt ceiling updates, automated liquidity management, and even the petting of Aavegotchis.",
            "speakers": [
              {
                "name": "Hilmar Orth (Gelato)",
                "image": "/public/images/hilmar_orth.jpg"
              }
            ]
          },
          {
            "time": "15:30",
            "title": "zkEVM march to mainnet",
            "description": "TBA",
            "speakers": [
              {
                "name": "Alex Gluchowski (ZkSync)",
                "image": "/public/images/alex_gluchowski.png"
              }
            ]
          },
          {
            "time": "16:00",
            "title": "Discussion Panel: Security",
            "description": "Panelists: Uri Kirstein (Certora), Kacper Bąk (Quantstamp), Piotr Cielas (Halborn), Damian Rusinek (Composable Security)",
            "speakers": [
              {
                "name": "Moderated by Marek Kirejczyk (TrueFi)",
                "image": "/public/images/marek_kirejczyk.jpeg"
              }
            ]
          },
          {
            "time": "17:00",
            "title": "Web3 actions: Scalable Web3 backend",
            "description": "Tenderly built Web3 Actions to improve the developer experience and reduce the complexity and costs of setting up a connective layer between Smart Contracts and other components in developers' systems. In essence, Web3 Actions take away the repetitive and time-consuming infrastructural work, allowing you to focus on writing the code to respond when on-chain circumstances or certain off-chain events change. And the goal of this workshop will be to demonstrate just that!",
            "speakers": [
              {
                "name": "Luka Anicin (Tenderly)",
                "image": "/public/images/luka_anicin.jpg"
              }
            ]
          },
          {
            "time": "17:30",
            "title": "🤫🤫🤫",
            "description": "🤯🤯🤯",
            "speakers": [
              {
                "name": "😎😎😎"
              }
            ]
          },
          {
            "time": "18:00",
            "title": "Hackathon Opening"
          },
          {
            "time": "18:30",
            "title": "Arweave & Warp Contracts Opening Workshop",
            "description": "Learn how to start with Arweave & Warp Contracts and compete for $10,000 total bounties brought by Warp & RedStone!",
            "speakers": [
              {
                "name": "Arweave",
                "image": "/public/images/arweave.jpeg"
              }
            ]
          },
          {
            "time": "🌙",
            "title": "🛠 Overnight hacking session"
          }
        ]
      },
      "workshopStage": {
        "events": [
          {
            "time": "10:00",
            "title": "Finding bugs with formal verification",
            "description": "In this workshop you will learn about the Certora prover and how useful it is for catching bugs. We will briefly explain how it works, and then you’ll get some hands-on experience in writing your first formal verification rules and running them. Please register here: <a href='https://www.certora.com/events/ethwarsaw-certora-workshop/' target='_blank' rel='noopener noreferrer'>https://www.certora.com/events/ethwarsaw-certora-workshop/</a> Installation guide: <a href='https://docs.google.com/document/d/1XvHLZlPzdu_Ju7FpjoFKh51UFmvcP1lhH3ib0fzHuN8/edit?usp=sharing' target='_blank' rel='noopener noreferrer'>https://docs.google.com/document/d/1XvHLZlPzdu_Ju7FpjoFKh51UFmvcP1lhH3ib0fzHuN8/edit?usp=sharing</a>",
            "speakers": [
              {
                "name": "Certora",
                "image": "/public/images/certora.jpeg"
              }
            ]
          },
          {
            "time": "12:00",
            "title": "Hackathon oracle integration with a few lines of code & deploying modular smart contracts on Arweave (Workshop)",
            "description": "Storage-less oracles could become a game-changer for Web3, offering better scalability and shorter data refresh intervals. Simultaneously, modular smart-contract architecture is one of the hottest topics in recent weeks. At this workshop, you'll learn how to integrate Oracle data on a hackathon and how to implement Warp Contracts on top of the Arweave storage chain, allowing you to create unique hackathon projects with heavy data processing requirements.</br></br><a href='https://redstone.finance/' target='_blank' rel='noopener noreferrer'>redstone.finance</a>, </br><a href='https://warp.cc/' target='_blank' rel='noopener noreferrer'>warp.cc</a>",
            "speakers": [
              {
                "name": "Redstone Finance",
                "image": "/public/images/redstone_finance.png"
              }
            ]
          },
          {
            "time": "13:00",
            "title": "🥟Lunch Break"
          },
          {
            "time": "14:00",
            "title": "Hackathon oracle integration with a few lines of code & deploying modular smart contracts on Arweave (Workshop)",
            "description": "Storage-less oracles could become a game-changer for Web3, offering better scalability and shorter data refresh intervals. Simultaneously, modular smart-contract architecture is one of the hottest topics in recent weeks. At this workshop, you'll learn how to integrate Oracle data on a hackathon and how to implement Warp Contracts on top of the Arweave storage chain, allowing you to create unique hackathon projects with heavy data processing requirements.</br></br><a href='https://redstone.finance/' target='_blank' rel='noopener noreferrer'>redstone.finance</a>, </br><a href='https://warp.cc/' target='_blank' rel='noopener noreferrer'>warp.cc</a>",
            "speakers": [
              {
                "name": "Redstone Finance",
                "image": "/public/images/redstone_finance.png"
              }
            ]
          },
          {
            "time": "15:00",
            "title": "AlephZero & Supercolony workshop",
            "description": "TBA",
            "speakers": [
              {
                "name": "AlephZero",
                "image": "/public/images/alephzero.jpeg"
              },
              {
                "name": "Supercolony",
                "image": "/public/images/supercolony.jpeg"
              }
            ]
          },
          {
            "time": "16:00",
            "title": "StarkNet 101 - Introduction to Cairo smart contracts. Unleash the power of ZK-STARKs.",
            "description": "You will learn what StarkNet is, how it works and why it's so good. We’ll introduce you to the Cairo language, StarkNet ecosystem and tools. Then, in the practical part, you’ll build and deploy your own smart contract. No prior blockchain experience required, although we assume you have some general programming knowledge.",
            "speakers": [
              {
                "name": "StarkWare",
                "image": "/public/images/starkware.png"
              }
            ]
          },
          {
            "time": "18:00",
            "title": "Hackathon Opening"
          },
          {
            "time": "🌙",
            "title": "🛠 Overnight hacking session"
          }
        ]
      }
    },
    {
      "date": "03.09.2022",
      "mainStage": {
        "events": [
          {
            "time": "09:00",
            "title": "Breakfast with hackers"
          },
          {
            "time": "10:00",
            "title": "Open Mic session"
          },
          {
            "time": "13:00",
            "title": "🥟Lunch with Stani Kulechov (👻AAVE) !!Hackers Only!!"
          },
          {
            "time": "14:00",
            "title": "Panel: How to make your hackathon project stand out",
            "speakers": [
              {
                "name": "Marek Kirejczyk (TrueFi CTO)",
                "image": "/public/images/marek_kirejczyk.jpeg"
              },
              {
                "name": "Stani Kulechov (Aave Founder)",
                "image": "/public/images/stani_kulechov.jpeg"
              },
              {
                "name": "Alex Gluchowski (Matter Labs CEO)",
                "image": "/public/images/alex_gluchowski.png"
              },
              {
                "name": "Jakub Wojciechowski (RedStone Founder)",
                "image": "/public/images/jakub_wojciechowski.jpg"
              }
            ]
          },
          {
            "time": "15:00",
            "title": "Open Mic session"
          },
          {
            "time": "🌙",
            "title": "🛠 Overnight hacking session"
          }
        ]
      }
    },
    {
      "date": "04.09.2022",
      "mainStage": {
        "events": [
          {
            "time": "10:00",
            "title": "Hackathon submissions deadline"
          },
          {
            "time": "11:00",
            "title": "Judging sessions for ETHWarsaw Prizes"
          },
          {
            "time": "16:00",
            "title": "Hackathon winners announcement"
          },
          {
            "time": "18:00",
            "title": "🧜‍♀️TrueFi x Ramp x ETHWarsaw After Party!💃"
          }
        ]
      }
    }
  ]
}